Revit 2027 API
BuiltInFailures.BlendFailures Class
 Failures about Blend.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.BlendFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class BlendFailures
Public NotInheritable Class BlendFailures
public ref class BlendFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type BlendFailures = class end
The BuiltInFailures.BlendFailures type exposes the following members.
Properties
Name | Description
CannotDrawBlend |  Can't create blend.
Top
See Also
Reference
Autodesk.Revit.DB Namespace